spec/support/vcr_cassettes/claims_api/bgs/vnp_ptcpnt_phone_service/valid_vnp_ptcpnt_phone_create_international_phone.yml

---
http_interactions:
- request:
    method: post
    uri: "<BGS_BASE_URL>/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>127.0.0.1</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:vnpPtcpntPhoneCreate><arg0>
        <vnpProcId>3874842</vnpProcId><vnpPtcpntId>209001</vnpPtcpntId><phoneTypeNm>Daytime</phoneTypeNm><phoneNbr> </phoneNbr><cntryNbr>11</cntryNbr><frgnPhoneRfrncTxt>223333 4444</frgnPhoneRfrncTxt><efctvDt>2025-12-30T19:54:55Z</efctvDt></arg0>
        </tns:vnpPtcpntPhoneCreate>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - "<FARADAY_VERSION>"
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntPhoneCreate"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 02 Jan 2026 17:31:06 GMT
      Server:
      - Apache/2.4.37 (Red Hat Enterprise Linux) OpenSSL/1.1.1k
      X-Oneagent-Js-Injection:
      - 'true'
      Server-Timing:
      - dtSInfo;desc="0", dtRpid;desc="-1076459555"
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpPtcpntPhoneCreateResponse
        xmlns:ns0="http://ptcpntPhoneService.services.vonapp.vba.va.gov/"><return><vnpPtcpntPhoneId>114847</vnpPtcpntPhoneId><vnpProcId>3874842</vnpProcId><vnpPtcpntId>209001</vnpPtcpntId><phoneTypeNm>Daytime</phoneTypeNm><phoneNbr>
        </phoneNbr><efctvDt>2025-12-30T19:54:55Z</efctvDt><cntryNbr>11</cntryNbr><frgnPhoneRfrncTxt>223333
        4444</frgnPhoneRfrncTxt></return></ns0:vnpPtcpntPhoneCreateResponse></S:Body></S:Envelope>
  recorded_at: Fri, 02 Jan 2026 17:31:07 GMT
recorded_with: VCR 6.3.1
