spec/support/vcr_cassettes/claims_api/bgs/vnp_ptcpnt_phone_service/vnp_ptcpnt_phone_find_by_primary_key.yml

---
http_interactions:
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>192.168.0.252</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:vnpPtcpntPhoneFindByPrimaryKey>
              <arg0>
        <vnpProcId>29798</vnpProcId><vnpPtcpntId>44693</vnpPtcpntId><phoneTypeNm>Daytime</phoneTypeNm><phoneNbr>2225552252</phoneNbr><efctvDt>2020-07-16T18:20:17Z</efctvDt></arg0>

            </tns:vnpPtcpntPhoneFindByPrimaryKey>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - Faraday v2.9.0
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntPhoneFindByPrimaryKey"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 29 Mar 2024 14:37:14 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpPtcpntPhoneFindByPrimaryKeyResponse
        xmlns:ns0="http://ptcpntPhoneService.services.vonapp.vba.va.gov/"><return><vnpPtcpntPhoneId>30888</vnpPtcpntPhoneId><vnpProcId>29798</vnpProcId><vnpPtcpntId>44693</vnpPtcpntId><phoneTypeNm>Daytime</phoneTypeNm><phoneNbr>2225552252</phoneNbr><efctvDt>2020-07-16T18:20:17Z</efctvDt></return></ns0:vnpPtcpntPhoneFindByPrimaryKeyResponse></S:Body></S:Envelope>
  recorded_at: Fri, 29 Mar 2024 14:37:14 GMT
recorded_with: VCR 6.2.0
