spec/support/vcr_cassettes/bgs/base/create_phone.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 23 Apr 2020 00:41:08 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" name="VnpPtcpntPhoneService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPtcpntPhoneUpdate">
        <part name="parameters" element="tns:vnpPtcpntPhoneUpdate"/>
        </message>
        <message name="vnpPtcpntPhoneUpdateResponse">
        <part name="parameters" element="tns:vnpPtcpntPhoneUpdateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPtcpntPhoneCreate">
        <part name="parameters" element="tns:vnpPtcpntPhoneCreate"/>
        </message>
        <message name="vnpPtcpntPhoneCreateResponse">
        <part name="parameters" element="tns:vnpPtcpntPhoneCreateResponse"/>
        </message>
        <message name="vnpPtcpntPhoneRemove">
        <part name="parameters" element="tns:vnpPtcpntPhoneRemove"/>
        </message>
        <message name="vnpPtcpntPhoneRemoveResponse">
        <part name="parameters" element="tns:vnpPtcpntPhoneRemoveResponse"/>
        </message>
        <message name="findPhoneAllAsArray">
        <part name="parameters" element="tns:findPhoneAllAsArray"/>
        </message>
        <message name="findPhoneAllAsArrayResponse">
        <part name="parameters" element="tns:findPhoneAllAsArrayResponse"/>
        </message>
        <message name="vnpPtcpntPhoneFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPtcpntPhoneFindByPrimaryKey"/>
        </message>
        <message name="vnpPtcpntPhoneFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPtcpntPhoneFindByPrimaryKeyResponse"/>
        </message>
        <portType name="VnpPtcpntPhoneService">
        <operation name="vnpPtcpntPhoneUpdate">
        <input message="tns:vnpPtcpntPhoneUpdate"/>
        <output message="tns:vnpPtcpntPhoneUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntPhoneCreate">
        <input message="tns:vnpPtcpntPhoneCreate"/>
        <output message="tns:vnpPtcpntPhoneCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntPhoneRemove">
        <input message="tns:vnpPtcpntPhoneRemove"/>
        <output message="tns:vnpPtcpntPhoneRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="findPhoneAllAsArray">
        <input message="tns:findPhoneAllAsArray"/>
        <output message="tns:findPhoneAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntPhoneFindByPrimaryKey">
        <input message="tns:vnpPtcpntPhoneFindByPrimaryKey"/>
        <output message="tns:vnpPtcpntPhoneFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPtcpntPhoneServicePortBinding" type="tns:VnpPtcpntPhoneService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPtcpntPhoneUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntPhoneCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntPhoneRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findPhoneAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntPhoneFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPtcpntPhoneService">
        <port name="VnpPtcpntPhoneServicePort" binding="tns:VnpPtcpntPhoneServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Thu, 23 Apr 2020 00:41:08 GMT
- request:
    method: post
    uri: http://linktestbepbenefits.vba.va.gov/VnpPtcpntPhoneWebServiceBean/VnpPtcpntPhoneService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntPhoneService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.0.147</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>76930593167944976</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPtcpntPhoneCreate><arg0><vnpPtcpntPhoneId xsi:nil="true"/><vnpProcId>3828033</vnpProcId><vnpPtcpntId>146189</vnpPtcpntId><phoneTypeNm>Nighttime</phoneTypeNm><phoneNbr>5555555555</phoneNbr><efctvDt>2020-04-23T00:41:07Z</efctvDt><endDt xsi:nil="true"/><areaNbr xsi:nil="true"/><cntryNbr xsi:nil="true"/><frgnPhoneRfrncTxt xsi:nil="true"/><extnsnNbr xsi:nil="true"/><jrnDt>2020-04-23T00:41:07Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnUserId>VAgovAPI</jrnUserId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnObjId>VAgovAPI</jrnObjId></arg0></tns:vnpPtcpntPhoneCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntPhoneCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1494'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.17.9
      Date:
      - Thu, 23 Apr 2020 00:41:09 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '975'
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></S:Header><S:Body><ns2:vnpPtcpntPhoneCreateResponse
        xmlns:ns2="http://ptcpntPhoneService.services.vonapp.vba.va.gov/"><return><vnpPtcpntPhoneId>75601</vnpPtcpntPhoneId><vnpProcId>3828033</vnpProcId><vnpPtcpntId>146189</vnpPtcpntId><phoneTypeNm>Nighttime</phoneTypeNm><phoneNbr>5555555555</phoneNbr><efctvDt>2020-04-23T00:41:07Z</efctvDt><areaNbr></areaNbr><cntryNbr></cntryNbr><frgnPhoneRfrncTxt></frgnPhoneRfrncTxt><extnsnNbr></extnsnNbr><jrnDt>2020-04-23T00:41:07Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnUserId>VAgovAPI</jrnUserId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnObjId>VAgovAPI</jrnObjId></return></ns2:vnpPtcpntPhoneCreateResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Thu, 23 Apr 2020 00:41:09 GMT
recorded_with: VCR 5.1.0
